"use client";
import React from "react";
import Image from "next/image";
import Box from "./components/Box";
// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//

export default function Index() {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────

  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return (
    <>
      <section className="mx-auto h-[408px] w-[1141px]">
        <h2 className="mb-6 text-center text-[32px] font-medium leading-[38.4px] text-[#212121]">
          ارزش های ما
        </h2>
        <section className="grid w-full grid-cols-5 gap-5">
          <Box
            image="/assets/images/Group-538.svg"
            title="مشتری محوری"
            text="مشتری‌محوری برای ما، تنها به معنای حق تقدم مشتری یا کلیشه «همیشه حق با مشتری‌ست» نیست؛ بلکه به معنی «همراه مشتری بودن» است. ما کنار مشتری هستیم، نه در مقابل آنها و تنها به فکر سود و زیان خود نیستیم."
          />
          <Box
            image="/assets/images/Group-538.svg"
            title="مشتری محوری"
            text="مشتری‌محوری برای ما، تنها به معنای حق تقدم مشتری یا کلیشه «همیشه حق با مشتری‌ست» نیست؛ بلکه به معنی «همراه مشتری بودن» است. ما کنار مشتری هستیم، نه در مقابل آنها و تنها به فکر سود و زیان خود نیستیم."
          />
          <Box
            image="/assets/images/Group-538.svg"
            title="مشتری محوری"
            text="مشتری‌محوری برای ما، تنها به معنای حق تقدم مشتری یا کلیشه «همیشه حق با مشتری‌ست» نیست؛ بلکه به معنی «همراه مشتری بودن» است. ما کنار مشتری هستیم، نه در مقابل آنها و تنها به فکر سود و زیان خود نیستیم."
          />
          <Box
            image="/assets/images/Group-538.svg"
            title="مشتری محوری"
            text="مشتری‌محوری برای ما، تنها به معنای حق تقدم مشتری یا کلیشه «همیشه حق با مشتری‌ست» نیست؛ بلکه به معنی «همراه مشتری بودن» است. ما کنار مشتری هستیم، نه در مقابل آنها و تنها به فکر سود و زیان خود نیستیم."
          />
          <Box
            image="/assets/images/Group-538.svg"
            title="مشتری محوری"
            text="مشتری‌محوری برای ما، تنها به معنای حق تقدم مشتری یا کلیشه «همیشه حق با مشتری‌ست» نیست؛ بلکه به معنی «همراه مشتری بودن» است. ما کنار مشتری هستیم، نه در مقابل آنها و تنها به فکر سود و زیان خود نیستیم."
          />
        </section>
      </section>
    </>
  );
}
