import React from "react";
import Image from "next/image";
//
// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//

export default function Index() {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────

  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return (
    <section className=" max-w-full md:pb-[30px] xl:ml-[44px] xl:mt-[106.5px] xl:w-[460px]">
      <Image
        alt=""
        src="/assets/images/bglistvazeeat.png"
        width={460}
        height={300}
        className="mx-auto h-auto w-[60%] xl:h-[300px] xl:w-[460px]"
      />
      <section className="borde-solid mt-11 h-auto border-r-[2px] border-primary">
        <p className="mx-auto mr-3 text-[14px] leading-[27.64px] text-[#3E4151] xl:mr-2 xl:text-[16px]">
          برای استعلام جریمه‌ها و پرداخت آنها کافی است، شماره پلاک وسیله نقلیه
          خود را در این بخش وارد کنید و با انتخاب روش مناسب به‌روزترین مبلغ
          خلافی خودرو را مشاهده و نسبت به پرداخت آن‌ها اقدام کنید.
        </p>
      </section>
    </section>
  );
}
