"use client";
import React from "react";
import Image from "next/image";
// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//

export default function Index() {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────

  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return (
    <>
      <section className="mx-auto grid w-[95%] max-w-full gap-4 md:w-[80%] xl:mt-[120px] xl:w-[460px] xl:gap-[56px]">
        <Image
          alt=""
          src="/assets/images/inquiry.png"
          width={460}
          height={300}
          className="mx-auto w-[60%] md:w-[70%] xl:w-full"
        />
        <p className="h- border-r-[2px] border-[#4E94EA] px-2 text-justify text-[16px]  font-normal xl:mb-[80px]">
          برای پیگیری مدارک خودرو کافی است، شماره پلاک، کد ملی و تلفن همراه
          متعلق به کد ملی را وارد کنید تا وضعیت به‌روز صدور و ارسال مدارک خودرو
          را مشاهده کنید.
        </p>
      </section>
    </>
  );
}
