"use client";
import React from "react";
import Image from "next/image";
// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//

export default function Index() {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────

  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return (
    <>
      <section className="flex w-full flex-col items-center min-h-[600px]">
        {/* <h2 className="w-100 my-12  py-12 text-center text-[40px] text-[#212121]">
          داستان یک لبخند
        </h2>
        <p className="mb-6 w-[951.500px] text-center text-lg leading-[35px] text-[#585858]">
          رویای ما لبخند است؛ لبخندی برای همه ایران. ایجاد تجربه خوشایند خرید و
          فروش برای همه مخاطبان دیجی‌کالا از کاربران و مشتریان گرفته تا اهالی
          رسانه و فروشندگان، باور و مسئولیتی‌ست که از ابتدای آغاز به کار
          دیجی‌کالا مبنای تمام فعالیت‌ها و پیشرفت‌ها شد. حالا پس از گذشت ۱۵ سال
          از فعالیت دیجی‌کالا این باور به وظیفه‌ای شیرین تبدیل شده است. ما
          اینجاییم تا با توسعه محصولات متنوع و افزودن سرویس‌های مختلف در گروه
          دیجی‌کالا با محوریت تکنولوژی‌های مبتنی بر تجارت الکترونیک، تجربه لبخند
          را برای همه مخاطبانمان محقق کنیم.
        </p> */}
      </section>
    </>
  );
}
